Repository: katagaki/Tables
Catalog: Tables/Support/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# Help.Differences.Events
source: Event procedures such as Workbook_Open and Worksheet_Change don’t run automatically.
ja: Workbook_Open や Worksheet_Change などのイベントプロシージャは自動では実行されません。
ko: Workbook_Open이나 Worksheet_Change 같은 이벤트 프로시저는 자동으로 실행되지 않습니다.
zh_hans: Workbook_Open、Worksheet_Change 等事件过程不会自动运行。
zh_hant: Workbook_Open、Worksheet_Change 等事件程序不會自動執行。

# Help.Differences.Messages
source: Error messages from running code, such as “Type mismatch”, use VBA’s English wording, so code that checks Err.Description sees what it would in English Excel.
ja: 実行時のエラーメッセージ（「Type mismatch」など）は VBA の英語の文言を使います。Err.Description を確認するコードは、英語版 Excel と同じ内容を受け取ります。
ko: “Type mismatch” 같은 실행 오류 메시지는 VBA의 영어 문구를 사용하므로, Err.Description을 확인하는 코드는 영어판 Excel과 같은 내용을 받습니다.
zh_hans: 运行代码时的错误信息（如“Type mismatch”）使用 VBA 的英文措辞，因此检查 Err.Description 的代码得到的内容与英文版 Excel 相同。
zh_hant: 執行程式碼時的錯誤訊息（如「Type mismatch」）使用 VBA 的英文措辭，因此檢查 Err.Description 的程式碼得到的內容與英文版 Excel 相同。

# Help.Differences.Rows
source: A Tables sheet has up to 100,000 rows and 4,096 columns, so Rows.Count is 100,000 rather than Excel’s 1,048,576. Finding the last row with Cells(Rows.Count, 1).End(xlUp) works the same.
ja: Tables のシートは最大 100,000 行、4,096 列のため、Rows.Count は Excel の 1,048,576 ではなく 100,000 になります。Cells(Rows.Count, 1).End(xlUp) で最終行を求める方法はそのまま使えます。
ko: Tables 시트는 최대 100,000행, 4,096열이므로 Rows.Count는 Excel의 1,048,576이 아니라 100,000입니다. Cells(Rows.Count, 1).End(xlUp)로 마지막 행을 찾는 방법은 그대로 작동합니다.
zh_hans: Tables 工作表最多有 100,000 行和 4,096 列，因此 Rows.Count 为 100,000，而不是 Excel 的 1,048,576。用 Cells(Rows.Count, 1).End(xlUp) 查找最后一行的方法照样有效。
zh_hant: Tables 工作表最多有 100,000 列和 4,096 欄，因此 Rows.Count 為 100,000，而不是 Excel 的 1,048,576。用 Cells(Rows.Count, 1).End(xlUp) 尋找最後一列的方法照樣有效。

# Help.Differences.Structure
source: Delete and Insert work on whole rows and columns. Shifting part of a sheet up or across isn’t supported, because formulas pointing at the moved cells wouldn’t follow them.
ja: Delete と Insert は行全体・列全体に対してのみ使えます。シートの一部だけを上や横にずらす操作は、移動したセルを参照する数式が追従しないため、サポートしていません。
ko: Delete와 Insert는 행 전체와 열 전체에서만 작동합니다. 시트의 일부만 위나 옆으로 이동하는 작업은 이동한 셀을 가리키는 수식이 따라가지 않으므로 지원되지 않습니다.
zh_hans: Delete 和 Insert 只适用于整行和整列。不支持将工作表的一部分上移或横移，因为指向被移动单元格的公式不会随之更新。
zh_hant: Delete 和 Insert 只適用於整列和整欄。不支援將工作表的一部分上移或橫移，因為指向被移動儲存格的公式不會隨之更新。

# Help.Differences.Title
source: Differences from Excel
ja: Excel との違い
ko: Excel과의 차이점
zh_hans: 与 Excel 的区别
zh_hant: 與 Excel 的差異

# Help.Editor.Checking
source: Code is checked as you type. If something can’t be read, a banner above the code says what, and on which line.
ja: コードは入力中に検証されます。読み取れない部分があると、コードの上のバナーに内容と行番号が表示されます。
ko: 코드는 입력하는 동안 확인됩니다. 읽을 수 없는 부분이 있으면 코드 위의 배너에 내용과 줄 번호가 표시됩니다.
zh_hans: 代码会在输入时检查。如有无法识别的内容，代码上方的横幅会说明问题及所在行。
zh_hant: 程式碼會在輸入時檢查。如有無法識別的內容，程式碼上方的橫幅會說明問題及所在行。

# Help.Editor.Indent
source: Return starts the next line indented for the block you’re in, and lines such as End Sub, Next and Else move back to line up with the line that opened the block. Long lines scroll sideways; turn on Wrap Lines to fit them to the screen instead.
ja: Return キーを押すと、次の行がブロックに合わせてインデントされます。End Sub、Next、Else などの行は、ブロックを開始した行の位置に戻ります。長い行は横にスクロールします。画面に収めたい場合は「行を折り返す」をオンにしてください。
ko: Return 키를 누르면 다음 줄이 현재 블록에 맞게 들여쓰기됩니다. End Sub, Next, Else 같은 줄은 블록을 시작한 줄에 맞춰 내어쓰기됩니다. 긴 줄은 옆으로 스크롤됩니다. 화면에 맞추려면 줄 바꿈을 켜십시오.
zh_hans: 按 Return 键后，下一行会按所在代码块缩进；End Sub、Next、Else 等行会退回到与开始该代码块的行对齐。长行可以横向滚动；如需让其适应屏幕，请打开“自动换行”。
zh_hant: 按 Return 鍵後，下一行會依所在程式碼區塊縮排；End Sub、Next、Else 等行會退回到與開始該區塊的行對齊。長行可以橫向捲動；如需讓其符合螢幕寬度，請打開「自動換行」。

# Help.Editor.Modules
source: Use + next to Code to add a standard module or a class module. Touch and hold a module, or swipe it, to rename or remove it. The workbook’s and sheets’ own modules belong to them and can’t be renamed or removed.
ja: 「コード」の横の＋で標準モジュールまたはクラスモジュールを追加できます。モジュールを長押しするかスワイプすると、名前の変更や削除ができます。ブックやシート自身のモジュールは、名前の変更も削除もできません。
ko: 코드 옆의 +를 사용해 표준 모듈이나 클래스 모듈을 추가할 수 있습니다. 모듈을 길게 누르거나 쓸어넘기면 이름을 변경하거나 제거할 수 있습니다. 통합 문서와 시트 자체의 모듈은 이름을 변경하거나 제거할 수 없습니다.
zh_hans: 使用“代码”旁的 + 添加标准模块或类模块。按住或轻扫模块即可重命名或移除。工作簿和工作表自带的模块不能重命名或移除。
zh_hant: 使用「程式碼」旁的 + 加入標準模組或類別模組。按住或滑動模組即可重新命名或移除。活頁簿和工作表本身的模組不能重新命名或移除。

# Help.Editor.Output
source: Whatever a macro prints with Debug.Print appears under Output in the Macros list after it runs.
ja: マクロが Debug.Print で出力した内容は、実行後にマクロ一覧の「出力」に表示されます。
ko: 매크로가 Debug.Print로 출력한 내용은 실행 후 매크로 목록의 출력 아래에 표시됩니다.
zh_hans: 宏用 Debug.Print 输出的内容会在运行后显示在宏列表的“输出”下。
zh_hant: 巨集用 Debug.Print 輸出的內容會在執行後顯示在巨集列表的「輸出」下。

# Help.Editor.Saving
source: Tap a module under Code to edit it. Changes go into the workbook when you press Save or go back, and each save can be undone.
ja: 「コード」の下のモジュールをタップすると編集できます。「保存」を押すか前の画面に戻ると変更がブックに反映され、保存ごとに取り消すことができます。
ko: 코드 아래의 모듈을 탭하면 편집할 수 있습니다. 저장을 누르거나 뒤로 돌아가면 변경 사항이 통합 문서에 반영되며, 저장할 때마다 실행 취소할 수 있습니다.
zh_hans: 轻点“代码”下的模块即可编辑。按“保存”或返回时，更改会写入工作簿，每次保存都可以撤销。
zh_hant: 點一下「程式碼」下的模組即可編輯。按「儲存」或返回時，更改會寫入活頁簿，每次儲存都可以還原。

# Help.Editor.Title
source: Writing Code
ja: コードの作成
ko: 코드 작성
zh_hans: 编写代码
zh_hant: 撰寫程式碼

# Help.Excel.Intro
source: Macros see the workbook through the same objects as in Excel. Range, Cells, Rows, Columns, ActiveSheet, ActiveCell and Selection without a sheet in front refer to the sheet that is showing, and a sheet’s code name, such as Sheet1, works too.
ja: マクロは Excel と同じオブジェクトを通じてブックを扱います。シートを指定しない Range、Cells、Rows、Columns、ActiveSheet、ActiveCell、Selection は表示中のシートを指し、Sheet1 のようなシートのコード名も使えます。
ko: 매크로는 Excel과 같은 개체를 통해 통합 문서를 다룹니다. 시트를 지정하지 않은 Range, Cells, Rows, Columns, ActiveSheet, ActiveCell, Selection은 표시 중인 시트를 가리키며, Sheet1 같은 시트 코드 이름도 사용할 수 있습니다.
zh_hans: 宏通过与 Excel 相同的对象访问工作簿。不带工作表前缀的 Range、Cells、Rows、Columns、ActiveSheet、ActiveCell 和 Selection 指向当前显示的工作表，也可以使用 Sheet1 这样的工作表代码名称。
zh_hant: 巨集透過與 Excel 相同的物件存取活頁簿。不帶工作表前綴的 Range、Cells、Rows、Columns、ActiveSheet、ActiveCell 和 Selection 指向目前顯示的工作表，也可以使用 Sheet1 這樣的工作表程式碼名稱。

# Help.Excel.RangeNote
source: Value reads and writes whole blocks as two-dimensional arrays. Delete and Insert work on whole rows and columns.
ja: Value では範囲全体を 2 次元配列として読み書きできます。Delete と Insert は行全体・列全体に対して使えます。
ko: Value는 범위 전체를 2차원 배열로 읽고 씁니다. Delete와 Insert는 행 전체와 열 전체에서 작동합니다.
zh_hans: Value 以二维数组读写整个区域。Delete 和 Insert 适用于整行和整列。
zh_hant: Value 以二維陣列讀寫整個範圍。Delete 和 Insert 適用於整列和整欄。

# Help.Excel.Settings
source: Settings such as Application.ScreenUpdating, DisplayAlerts and Calculation are accepted so that existing macros run, but they have no effect: Tables always updates the sheet once, when the macro finishes.
ja: Application.ScreenUpdating、DisplayAlerts、Calculation などの設定は、既存のマクロが動くように受け付けますが、効果はありません。Tables はマクロの終了時に一度だけシートを更新します。
ko: Application.ScreenUpdating, DisplayAlerts, Calculation 같은 설정은 기존 매크로가 작동하도록 허용되지만 효과는 없습니다. Tables는 매크로가 끝날 때 한 번만 시트를 업데이트합니다.
zh_hans: Application.ScreenUpdating、DisplayAlerts、Calculation 等设置会被接受，以便现有宏能够运行，但不会生效：Tables 始终在宏结束时更新一次工作表。
zh_hant: Application.ScreenUpdating、DisplayAlerts、Calculation 等設定會被接受，以便現有巨集能夠執行，但不會生效：Tables 一律在巨集結束時更新一次工作表。

# Help.Excel.SheetsNote
source: Sheets includes chart sheets; Worksheets doesn’t. Both can be walked with For Each.
ja: Sheets にはグラフシートも含まれますが、Worksheets には含まれません。どちらも For Each で順に処理できます。
ko: Sheets에는 차트 시트가 포함되지만 Worksheets에는 포함되지 않습니다. 둘 다 For Each로 순회할 수 있습니다.
zh_hans: Sheets 包含图表工作表，Worksheets 不包含。两者都可以用 For Each 遍历。
zh_hant: Sheets 包含圖表工作表，Worksheets 不包含。兩者都可以用 For Each 逐一處理。

# Help.Excel.Title
source: Excel Objects
ja: Excel のオブジェクト
ko: Excel 개체
zh_hans: Excel 对象
zh_hant: Excel 物件

# Help.Excel.WorksheetFunctionNote
source: Every function the formula bar knows can be called this way, worked out by the same engine as your cells.
ja: 数式バーで使えるすべての関数をこの方法で呼び出せます。計算はセルと同じエンジンで行われます。
ko: 수식 입력줄에서 사용할 수 있는 모든 함수를 이 방법으로 호출할 수 있으며, 셀과 같은 엔진으로 계산됩니다.
zh_hans: 公式栏支持的所有函数都可以这样调用，并由与单元格相同的引擎计算。
zh_hant: 公式列支援的所有函數都可以這樣呼叫，並由與儲存格相同的引擎計算。

# Help.Footer
source: Search for any function, statement or object member to see whether Tables can run it.
ja: 関数、ステートメント、オブジェクトのメンバーを検索すると、Tables で実行できるかどうかを確認できます。
ko: 함수, 문, 개체 멤버를 검색하면 Tables에서 실행할 수 있는지 확인할 수 있습니다.
zh_hans: 搜索任意函数、语句或对象成员，即可查看 Tables 能否运行它。
zh_hant: 搜尋任何函數、陳述式或物件成員，即可查看 Tables 能否執行它。

# Help.Functions.Conversion
source: Conversion
ja: 型変換
ko: 변환
zh_hans: 类型转换
zh_hant: 類型轉換

# Help.Functions.Dates
source: Dates and times
ja: 日付と時刻
ko: 날짜와 시간
zh_hans: 日期与时间
zh_hant: 日期與時間

# Help.Functions.FormatNote
source: Format takes the same codes as cell number formats, such as "#,##0.00" or "yyyy-mm-dd", and named formats such as "Currency" and "Short Date".
ja: Format には、"#,##0.00" や "yyyy-mm-dd" のようなセルの表示形式と同じコードや、"Currency"、"Short Date" などの名前付き書式を指定できます。
ko: Format에는 "#,##0.00"이나 "yyyy-mm-dd" 같은 셀 표시 형식과 같은 코드와 "Currency", "Short Date" 같은 이름 있는 형식을 사용할 수 있습니다.
zh_hans: Format 使用与单元格数字格式相同的代码，如 "#,##0.00" 或 "yyyy-mm-dd"，也支持 "Currency"、"Short Date" 等命名格式。
zh_hant: Format 使用與儲存格數字格式相同的代碼，如 "#,##0.00" 或 "yyyy-mm-dd"，也支援 "Currency"、"Short Date" 等具名格式。

# Help.Functions.Information
source: Information
ja: 情報
ko: 정보
zh_hans: 信息
zh_hant: 資訊

# Help.Functions.Interaction
source: Interaction
ja: 対話
ko: 상호 작용
zh_hans: 交互
zh_hant: 互動

# Help.Functions.Intro
source: These functions from the VBA library can be used in every module.
ja: VBA ライブラリの次の関数は、どのモジュールでも使用できます。
ko: VBA 라이브러리의 다음 함수는 모든 모듈에서 사용할 수 있습니다.
zh_hans: VBA 库中的以下函数可在任何模块中使用。
zh_hant: VBA 程式庫中的以下函數可在任何模組中使用。

# Help.Functions.Math
source: Maths
ja: 数学
ko: 수학
zh_hans: 数学
zh_hant: 數學

# Help.Functions.Objects
source: Objects to create with New or CreateObject
ja: New または CreateObject で作成できるオブジェクト
ko: New 또는 CreateObject로 만들 수 있는 개체
zh_hans: 可用 New 或 CreateObject 创建的对象
zh_hant: 可用 New 或 CreateObject 建立的物件

# Help.Functions.Text
source: Text
ja: 文字列
ko: 텍스트
zh_hans: 文本
zh_hant: 文字

# Help.Functions.Title
source: Built-in Functions
ja: 組み込み関数
ko: 기본 제공 함수
zh_hans: 内置函数
zh_hant: 內建函數

# Help.Functions.UnavailableNote
source: These work with files, other apps or the system, which macros can’t reach here.
ja: これらはファイル、他のアプリ、システムを扱うもので、ここではマクロからアクセスできません。
ko: 이 항목들은 파일, 다른 앱 또는 시스템을 다루며, 여기서는 매크로가 접근할 수 없습니다.
zh_hans: 这些函数涉及文件、其他应用或系统，在这里宏无法访问。
zh_hant: 這些函數涉及檔案、其他 App 或系統，在這裡巨集無法存取。

# Help.Language.Errors
source: Error handling
ja: エラー処理
ko: 오류 처리
zh_hans: 错误处理
zh_hant: 錯誤處理

# Help.Language.Flow
source: Control flow
ja: 制御構造
ko: 제어 흐름
zh_hans: 流程控制
zh_hant: 流程控制

# Help.Language.Intro
source: Tables runs the parts of VBA that spreadsheet macros use. Statements that can’t run are still accepted in the code, so the rest of a module works; they stop the macro only if they are reached.
ja: Tables は、スプレッドシートのマクロで使われる VBA の機能を実行します。実行できないステートメントもコードとしては受け付けるので、モジュールの他の部分は動作します。そのステートメントに到達したときにだけマクロが停止します。
ko: Tables는 스프레드시트 매크로에서 사용하는 VBA 기능을 실행합니다. 실행할 수 없는 문도 코드로는 허용되므로 모듈의 나머지 부분은 작동하며, 해당 문에 도달할 때만 매크로가 중지됩니다.
zh_hans: Tables 可运行电子表格宏所用的 VBA 功能。无法运行的语句仍可写在代码中，模块的其余部分照常工作；只有运行到这些语句时，宏才会停止。
zh_hant: Tables 可執行試算表巨集所用的 VBA 功能。無法執行的陳述式仍可寫在程式碼中，模組的其餘部分照常運作；只有執行到這些陳述式時，巨集才會停止。

# Help.Language.Objects
source: Classes and objects
ja: クラスとオブジェクト
ko: 클래스와 개체
zh_hans: 类与对象
zh_hant: 類別與物件

# Help.Language.Other
source: Also available
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

# Help.Language.Procedures
source: Procedures and arguments
ja: プロシージャと引数
ko: 프로시저와 인수
zh_hans: 过程与参数
zh_hant: 程序與引數

# Help.Language.Title
source: The VBA Language
ja: VBA 言語
ko: VBA 언어
zh_hans: VBA 语言
zh_hant: VBA 語言

# Help.Language.UnavailableNote
source: Event procedures can be written and kept, but they don’t run by themselves. Call them from another macro if you need them.
ja: イベントプロシージャは記述して保存できますが、自動では実行されません。必要な場合は別のマクロから呼び出してください。
ko: 이벤트 프로시저는 작성하고 저장할 수 있지만 자동으로 실행되지는 않습니다. 필요하면 다른 매크로에서 호출하십시오.
zh_hans: 事件过程可以编写和保存，但不会自动运行。如有需要，请从其他宏中调用。
zh_hant: 事件程序可以撰寫和保存，但不會自動執行。如有需要，請從其他巨集中呼叫。

# Help.Language.Variables
source: Variables and declarations
ja: 変数と宣言
ko: 변수와 선언
zh_hans: 变量与声明
zh_hant: 變數與宣告

# Help.Running.Ask
source: The first time you run a macro in a window, Tables asks you to confirm. Only run macros from people you trust.
ja: ウインドウで初めてマクロを実行するときは、確認が表示されます。信頼できる相手のマクロだけを実行してください。
ko: 윈도우에서 처음 매크로를 실행할 때 확인을 요청합니다. 신뢰할 수 있는 사람의 매크로만 실행하십시오.
zh_hans: 在一个窗口中第一次运行宏时，Tables 会请你确认。请只运行来自你信任的人的宏。
zh_hant: 在一個視窗中第一次執行巨集時，Tables 會請你確認。請只執行來自你信任的人的巨集。

# Help.Running.Choose
source: Open the Macros list from the toolbar and tap a macro to run it. Every public Sub without parameters in a standard module, or in the workbook’s or a sheet’s module, is listed. While it runs, a bar at the bottom of the window shows its name and a Stop button.
ja: ツールバーからマクロの一覧を開き、マクロをタップすると実行されます。標準モジュール、またはブックやシートのモジュールにある、引数のない Public な Sub がすべて一覧に表示されます。実行中はウインドウ下部のバーにマクロ名と「停止」ボタンが表示されます。
ko: 도구 막대에서 매크로 목록을 열고 매크로를 탭하면 실행됩니다. 표준 모듈이나 통합 문서 또는 시트 모듈에 있는, 매개변수가 없는 모든 Public Sub가 목록에 표시됩니다. 실행 중에는 윈도우 아래쪽 막대에 매크로 이름과 중지 버튼이 표시됩니다.
zh_hans: 从工具栏打开宏列表，轻点一个宏即可运行。标准模块、工作簿模块或工作表模块中所有不带参数的 Public Sub 都会列出。运行时，窗口底部的栏会显示宏的名称和“停止”按钮。
zh_hant: 從工具列打開巨集列表，點一下巨集即可執行。標準模組、活頁簿模組或工作表模組中所有不帶參數的 Public Sub 都會列出。執行時，視窗底部的列會顯示巨集名稱和「停止」按鈕。

# Help.Running.Files
source: Only macro-enabled workbooks (.xlsm) keep macros when they are saved. In an .xlsx file you can still write and run macros, but to keep them, share or save a copy as .xlsm.
ja: 保存時にマクロが残るのはマクロ有効ブック（.xlsm）だけです。.xlsx ファイルでもマクロを書いて実行できますが、残すには .xlsm として共有するか、コピーを保存してください。
ko: 저장할 때 매크로가 유지되는 것은 매크로 사용 통합 문서(.xlsm)뿐입니다. .xlsx 파일에서도 매크로를 작성하고 실행할 수 있지만, 유지하려면 .xlsm으로 공유하거나 사본을 저장하십시오.
zh_hans: 只有启用宏的工作簿（.xlsm）在保存时会保留宏。在 .xlsx 文件中仍可编写和运行宏，但要保留它们，请共享或另存一份 .xlsm 副本。
zh_hant: 只有啟用巨集的活頁簿（.xlsm）在儲存時會保留巨集。在 .xlsx 檔案中仍可撰寫和執行巨集，但若要保留，請分享或另存一份 .xlsm 副本。

# Help.Running.Sandbox
source: Macros run only inside this workbook. They can’t open files, start other apps or reach the internet, so code that tries stops with a message saying it isn’t supported.
ja: マクロはこのブックの中でのみ実行されます。ファイルを開いたり、他のアプリを起動したり、インターネットにアクセスしたりはできないため、そうしたコードはサポートされていない旨のメッセージを表示して停止します。
ko: 매크로는 이 통합 문서 안에서만 실행됩니다. 파일을 열거나, 다른 앱을 시작하거나, 인터넷에 접근할 수 없으므로 그런 코드는 지원되지 않는다는 메시지와 함께 중지됩니다.
zh_hans: 宏只在此工作簿内运行，无法打开文件、启动其他应用或访问互联网。尝试这样做的代码会停止，并提示不受支持。
zh_hant: 巨集只在此活頁簿內執行，無法打開檔案、啟動其他 App 或存取網際網路。嘗試這樣做的程式碼會停止，並提示不支援。

# Help.Running.Title
source: Running Macros
ja: マクロの実行
ko: 매크로 실행
zh_hans: 运行宏
zh_hant: 執行巨集

# Help.Running.Undo
source: A macro works on a copy of the workbook. When it finishes, everything it did is put back in one step, so a single Undo takes the whole run back. If it stops with an error, what it had done until then is kept, and can be undone the same way.
ja: マクロはブックのコピーに対して実行されます。終了すると、行われた変更がまとめて 1 回で反映されるので、1 回の取り消しで実行全体を元に戻せます。エラーで停止した場合も、それまでの変更は残り、同じように取り消せます。
ko: 매크로는 통합 문서의 사본에서 실행됩니다. 실행이 끝나면 모든 변경 사항이 한 번에 반영되므로, 한 번의 실행 취소로 전체 실행을 되돌릴 수 있습니다. 오류로 중지된 경우에도 그때까지의 변경 사항은 유지되며 같은 방법으로 실행 취소할 수 있습니다.
zh_hans: 宏在工作簿的副本上运行。运行结束时，所有更改会一次性写回，因此只需撤销一次就能撤回整次运行。如果因错误而停止，之前所做的更改会保留，也可以用同样的方式撤销。
zh_hant: 巨集在活頁簿的副本上執行。執行結束時，所有更改會一次寫回，因此只需還原一次就能撤回整次執行。如果因錯誤而停止，之前所做的更改會保留，也可以用同樣方式還原。

# Help.Search.Available
source: Available · %@
ja: 使用可能・%@
ko: 사용 가능 · %@
zh_hans: 可用 · %@
zh_hant: 可用 · %@

# Help.Search.NoResults.Message
source: “%@” isn’t in the help book. If a macro uses something Tables can’t run, it says so when that line is reached.
ja: 「%@」はヘルプに載っていません。Tables で実行できないものをマクロが使っている場合は、その行に来たときにメッセージが表示されます。
ko: “%@”은(는) 도움말에 없습니다. 매크로가 Tables에서 실행할 수 없는 항목을 사용하면 해당 줄에 도달할 때 알려 줍니다.
zh_hans: 帮助中没有“%@”。如果宏使用了 Tables 无法运行的内容，运行到那一行时会给出提示。
zh_hant: 輔助說明中沒有「%@」。如果巨集使用了 Tables 無法執行的內容，執行到那一行時會顯示提示。

# Help.Search.NoResults.Title
source: Not Listed
ja: 見つかりません
ko: 목록에 없음
zh_hans: 未列出
zh_hant: 未列出

# Help.Search.Prompt
source: Functions, statements, members
ja: 関数、ステートメント、メンバー
ko: 함수, 문, 멤버
zh_hans: 函数、语句、成员
zh_hant: 函數、陳述式、成員

# Help.Search.Unavailable
source: Not available in Tables
ja: Tables では使用できません
ko: Tables에서 사용할 수 없음
zh_hans: 在 Tables 中不可用
zh_hant: 在 Tables 中無法使用

# Help.Title
source: Macro Help
ja: マクロのヘルプ
ko: 매크로 도움말
zh_hans: 宏帮助
zh_hant: 巨集輔助說明

# Help.Unavailable
source: Not available in Tables
ja: Tables では使用できません
ko: Tables에서 사용할 수 없음
zh_hans: 在 Tables 中不可用
zh_hant: 在 Tables 中無法使用

# Intent.AddSheet.Description
source: Adds a sheet at the end of a workbook.
ja: ワークブックの末尾にシートを追加します。
ko: 통합 문서 끝에 시트를 추가합니다.
zh_hans: 在工作簿末尾添加一个工作表。
zh_hant: 在活頁簿末尾加入一個工作表。

# Intent.AddSheet.Summary ${name} ${workbook}
source: Add sheet ${name} to ${workbook}
ja: ${workbook} にシート ${name} を追加
ko: ${workbook}에 ${name} 시트 추가
zh_hans: 向 ${workbook} 添加工作表 ${name}
zh_hant: 在 ${workbook} 中加入工作表 ${name}

# Intent.AddSheet.Title
source: Add Sheet
ja: シートを追加
ko: 시트 추가
zh_hans: 添加工作表
zh_hant: 加入工作表

# Intent.AppendRow.Description
source: Adds a row of values below the last row holding anything.
ja: 内容のある最後の行の下に値の行を追加します。
ko: 내용이 있는 마지막 행 아래에 값 행을 추가합니다.
zh_hans: 在最后一个有内容的行下方添加一行值。
zh_hant: 在最後一個有內容的列下方加入一列值。

# Intent.AppendRow.Summary ${values} ${workbook}
source: Append ${values} as a row to ${workbook}
ja: ${values} を ${workbook} に行として追加
ko: ${values}을(를) ${workbook}에 행으로 추가
zh_hans: 将 ${values} 作为一行追加到 ${workbook}
zh_hant: 將 ${values} 作為一列附加到 ${workbook}

# Intent.AppendRow.Title
source: Append Row
ja: 行を追加
ko: 행 추가
zh_hans: 追加行
zh_hant: 附加列

# Intent.CellPart.Formula
source: Formula
ja: 数式
ko: 수식
zh_hans: 公式
zh_hant: 公式

# Intent.CellPart.Type
source: Cell Content
ja: セルの内容
ko: 셀 내용
zh_hans: 单元格内容
zh_hant: 儲存格內容

# Intent.CellPart.Value
source: Value
ja: 値
ko: 값
zh_hans: 值
zh_hant: 值

# Intent.Clear.Description
source: Empties a range's cells, keeping their formatting.
ja: 書式を残したまま範囲のセルを空にします。
ko: 서식은 유지한 채 범위의 셀을 비웁니다.
zh_hans: 清空区域中的单元格，保留其格式。
zh_hant: 清空範圍中的儲存格，保留其格式。

# Intent.Clear.Summary ${range} ${workbook}
source: Clear ${range} in ${workbook}
ja: ${workbook} の ${range} を消去
ko: ${workbook}의 ${range} 지우기
zh_hans: 清除 ${workbook} 中的 ${range}
zh_hant: 清除 ${workbook} 中的 ${range}

# Intent.Clear.Title
source: Clear Range
ja: 範囲を消去
ko: 범위 지우기
zh_hans: 清除区域
zh_hant: 清除範圍

# Intent.Create.Description
source: Makes a new, empty workbook.
ja: 新しい空のワークブックを作成します。
ko: 비어 있는 새 통합 문서를 만듭니다.
zh_hans: 创建一个新的空工作簿。
zh_hant: 建立新的空白活頁簿。

# Intent.Create.Summary ${name}
source: Create workbook named ${name}
ja: ${name} という名前のワークブックを作成
ko: ${name} 이름의 통합 문서 만들기
zh_hans: 创建名为 ${name} 的工作簿
zh_hant: 建立名為 ${name} 的活頁簿

# Intent.Create.Title
source: Create Workbook
ja: ワークブックを作成
ko: 통합 문서 만들기
zh_hans: 创建工作簿
zh_hant: 建立活頁簿

# Intent.DeleteSheet.Description
source: Removes a sheet from a workbook. A workbook always keeps one.
ja: ワークブックからシートを削除します。ワークブックには常に1つのシートが残ります。
ko: 통합 문서에서 시트를 삭제합니다. 통합 문서에는 항상 시트가 하나 남습니다.
zh_hans: 从工作簿中删除工作表。工作簿始终保留一个工作表。
zh_hant: 從活頁簿中刪除工作表。活頁簿始終保留一個工作表。

# Intent.DeleteSheet.Summary ${sheet} ${workbook}
source: Delete ${sheet} from ${workbook}
ja: ${workbook} から ${sheet} を削除
ko: ${workbook}에서 ${sheet} 삭제
zh_hans: 从 ${workbook} 中删除 ${sheet}
zh_hant: 從 ${workbook} 中刪除 ${sheet}

# Intent.DeleteSheet.Title
source: Delete Sheet
ja: シートを削除
ko: 시트 삭제
zh_hans: 删除工作表
zh_hant: 刪除工作表

# Intent.Evaluate.Description
source: Works out a formula, on its own or against a workbook's cells, without changing anything.
ja: 数式を単独で、またはワークブックのセルを使って計算します。何も変更しません。
ko: 수식을 단독으로 또는 통합 문서의 셀을 사용해 계산하며 아무것도 변경하지 않습니다.
zh_hans: 单独或基于工作簿的单元格计算公式，不更改任何内容。
zh_hant: 單獨或依據活頁簿的儲存格計算公式，不會更改任何內容。

# Intent.Evaluate.Summary ${formula}
source: Evaluate ${formula}
ja: ${formula} を計算
ko: ${formula} 계산
zh_hans: 计算 ${formula}
zh_hant: 計算 ${formula}

# Intent.Evaluate.Title
source: Evaluate Formula
ja: 数式を計算
ko: 수식 계산
zh_hans: 计算公式
zh_hant: 計算公式

# Intent.Export.Description
source: Turns a workbook into a file to save or share. CSV and TSV hold one sheet: the one named, or the first.
ja: ワークブックを保存や共有のためのファイルにします。CSV と TSV は1つのシート（指定したシート、または最初のシート）だけを含みます。
ko: 통합 문서를 저장하거나 공유할 파일로 만듭니다. CSV와 TSV에는 지정한 시트 또는 첫 번째 시트 하나만 들어갑니다.
zh_hans: 将工作簿转换为可存储或共享的文件。CSV 和 TSV 只包含一个工作表：指定的工作表或第一个工作表。
zh_hant: 將活頁簿轉為可儲存或分享的檔案。CSV 和 TSV 只包含一個工作表：指定的工作表或第一個工作表。

# Intent.Export.Summary ${workbook} ${format}
source: Export ${workbook} as ${format}
ja: ${workbook} を ${format} として書き出す
ko: ${workbook}을(를) ${format}(으)로 내보내기
zh_hans: 将 ${workbook} 导出为 ${format}
zh_hant: 將 ${workbook} 輸出為 ${format}

# Intent.Export.Title
source: Export Workbook
ja: ワークブックを書き出す
ko: 통합 문서 내보내기
zh_hans: 导出工作簿
zh_hant: 輸出活頁簿

# Intent.FindRows.Description
source: Finds the rows whose cell in a column meets a condition such as >100, apple* or <>done.
ja: 列のセルが「>100」「apple*」「<>done」などの条件を満たす行を検索します。
ko: 열의 셀이 >100, apple*, <>done 같은 조건을 만족하는 행을 찾습니다.
zh_hans: 查找某列单元格满足条件（如 >100、apple* 或 <>done）的行。
zh_hant: 尋找某欄儲存格符合條件（如 >100、apple* 或 <>done）的列。

# Intent.FindRows.Summary ${column} ${condition} ${workbook}
source: Find rows where column ${column} matches ${condition} in ${workbook}
ja: ${workbook} で列 ${column} が ${condition} に一致する行を検索
ko: ${workbook}에서 ${column} 열이 ${condition}과(와) 일치하는 행 찾기
zh_hans: 在 ${workbook} 中查找列 ${column} 符合 ${condition} 的行
zh_hant: 在 ${workbook} 中尋找欄 ${column} 符合 ${condition} 的列

# Intent.FindRows.Title
source: Find Rows
ja: 行を検索
ko: 행 찾기
zh_hans: 查找行
zh_hant: 尋找列

# Intent.Format.CSV
source: Comma-Separated Values
ja: カンマ区切り
ko: 쉼표로 구분된 값
zh_hans: 逗号分隔值
zh_hant: 逗號分隔值

# Intent.Format.TSV
source: Tab-Separated Values
ja: タブ区切り
ko: 탭으로 구분된 값
zh_hans: 制表符分隔值
zh_hant: 定位字元分隔值

# Intent.Format.Type
source: File Format
ja: ファイル形式
ko: 파일 형식
zh_hans: 文件格式
zh_hant: 檔案格式

# Intent.Format.XLSX
source: Excel Workbook
ja: Excel ワークブック
ko: Excel 통합 문서
zh_hans: Excel 工作簿
zh_hant: Excel 活頁簿

# Intent.GetCell.Description
source: Gets a cell's value as the sheet shows it, or its formula.
ja: シートに表示されるとおりのセルの値、またはその数式を取得します。
ko: 시트에 표시되는 셀 값 또는 수식을 가져옵니다.
zh_hans: 获取单元格在工作表中显示的值或其公式。
zh_hant: 取得儲存格在工作表中顯示的值或其公式。

# Intent.GetCell.Summary ${part} ${cell} ${workbook}
source: Get ${part} of ${cell} in ${workbook}
ja: ${workbook} の ${cell} の${part}を取得
ko: ${workbook}에서 ${cell}의 ${part} 가져오기
zh_hans: 获取 ${workbook} 中 ${cell} 的${part}
zh_hant: 取得 ${workbook} 中 ${cell} 的${part}

# Intent.GetCell.Title
source: Get Cell
ja: セルを取得
ko: 셀 가져오기
zh_hans: 获取单元格
zh_hant: 取得儲存格

# Intent.GetRange.Description
source: Gets a range's values as a list of cells, as rows of tab-separated text, or as CSV.
ja: 範囲の値を、セルのリスト、タブ区切りの行、または CSV として取得します。
ko: 범위의 값을 셀 목록, 탭으로 구분된 행 또는 CSV로 가져옵니다.
zh_hans: 以单元格列表、制表符分隔的行或 CSV 的形式获取区域的值。
zh_hant: 以儲存格列表、定位字元分隔的列或 CSV 取得範圍的值。

# Intent.GetRange.Summary ${range} ${workbook} ${layout}
source: Get ${range} in ${workbook} as ${layout}
ja: ${workbook} の ${range} を ${layout} として取得
ko: ${workbook}의 ${range}을(를) ${layout}(으)로 가져오기
zh_hans: 以 ${layout} 获取 ${workbook} 中的 ${range}
zh_hant: 以 ${layout} 取得 ${workbook} 中的 ${range}

# Intent.GetRange.Title
source: Get Range
ja: 範囲を取得
ko: 범위 가져오기
zh_hans: 获取区域
zh_hant: 取得範圍

# Intent.Layout.Cells
source: List of Cells
ja: セルのリスト
ko: 셀 목록
zh_hans: 单元格列表
zh_hant: 儲存格列表

# Intent.Layout.CSV
source: CSV Text
ja: CSV テキスト
ko: CSV 텍스트
zh_hans: CSV 文本
zh_hant: CSV 文字

# Intent.Layout.Rows
source: Rows
ja: 行
ko: 행
zh_hans: 行
zh_hant: 列

# Intent.Layout.Type
source: Layout
ja: レイアウト
ko: 레이아웃
zh_hans: 布局
zh_hant: 佈局

# Intent.ListSheets.Description
source: Gets the names of a workbook's sheets.
ja: ワークブックのシート名を取得します。
ko: 통합 문서의 시트 이름을 가져옵니다.
zh_hans: 获取工作簿中各工作表的名称。
zh_hant: 取得活頁簿中各工作表的名稱。

# Intent.ListSheets.Summary ${workbook}
source: Get sheets in ${workbook}
ja: ${workbook} のシートを取得
ko: ${workbook}의 시트 가져오기
zh_hans: 获取 ${workbook} 中的工作表
zh_hant: 取得 ${workbook} 中的工作表

# Intent.ListSheets.Title
source: Get Sheets
ja: シートを取得
ko: 시트 가져오기
zh_hans: 获取工作表
zh_hant: 取得工作表

# Intent.Open.Description
source: Reads an Excel workbook or a CSV or TSV file so other Tables actions can work with it.
ja: Excel ワークブック、または CSV・TSV ファイルを読み込み、ほかの Tables アクションで使えるようにします。
ko: Excel 통합 문서나 CSV 또는 TSV 파일을 읽어 다른 Tables 동작에서 사용할 수 있게 합니다.
zh_hans: 读取 Excel 工作簿或 CSV、TSV 文件，以便其他 Tables 操作使用。
zh_hant: 讀取 Excel 活頁簿或 CSV、TSV 檔案，供其他 Tables 動作使用。

# Intent.Open.Summary ${file}
source: Get workbook from ${file}
ja: ${file} からワークブックを取得
ko: ${file}에서 통합 문서 가져오기
zh_hans: 从 ${file} 获取工作簿
zh_hant: 從 ${file} 取得活頁簿
